examples/sglang_glm5.2/bench_rail_rdma0.out
[rails:rdma0] isl8192_osl128_c16 -> /wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c16.json
[aiter] import [module_aiter_core] under /sgl-workspace/aiter/aiter/jit/module_aiter_core.so
[aiter] merge tuned file under model_configs/ and configs/ /sgl-workspace/aiter/aiter/configs/bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv3_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv4_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm47_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm5_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/gptoss_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimi_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimik2_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama405B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama70B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/minimax_m3_eagle_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/qwen32B_bf16_tuned_gemm.csv
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c16.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=80, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=16, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c16.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
#Input tokens: 655360
#Output tokens: 10240
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 80/80 [01:19<00:00,  1.00it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 16        
Successful requests:                     80        
Benchmark duration (s):                  79.86     
Total input tokens:                      655360    
Total input text tokens:                 655360    
Total generated tokens:                  10240     
Total generated tokens (retokenized):    10239     
Request throughput (req/s):              1.00      
Input token throughput (tok/s):          8205.89   
Output token throughput (tok/s):         128.22    
Peak output token throughput (tok/s):    224.00    
Peak concurrent requests:                24        
Total token throughput (tok/s):          8334.11   
Concurrency:                             14.97     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   14948.15  
Median E2E Latency (ms):                 14420.80  
P90 E2E Latency (ms):                    17670.63  
P95 E2E Latency (ms):                    21948.41  
P99 E2E Latency (ms):                    21949.47  
---------------Time to First Token----------------
Mean TTFT (ms):                          6649.22   
Median TTFT (ms):                        6228.11   
P90 TTFT (ms):                           8930.60   
P95 TTFT (ms):                           12713.73  
P99 TTFT (ms):                           12714.17  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          65.35     
Median TPOT (ms):                        64.67     
P90 TPOT (ms):                           72.04     
P95 TPOT (ms):                           72.71     
P99 TPOT (ms):                           72.72     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           65.35     
Median ITL (ms):                         71.12     
P90 ITL (ms):                            72.63     
P95 ITL (ms):                            73.96     
P99 ITL (ms):                            75.60     
Max ITL (ms):                            144.51    
==================================================
[rails:rdma0] isl8192_osl128_c64 -> /wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c64.json
[aiter] import [module_aiter_core] under /sgl-workspace/aiter/aiter/jit/module_aiter_core.so
[aiter] merge tuned file under model_configs/ and configs/ /sgl-workspace/aiter/aiter/configs/bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv3_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv4_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm47_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm5_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/gptoss_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimi_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimik2_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama405B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama70B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/minimax_m3_eagle_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/qwen32B_bf16_tuned_gemm.csv
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=320, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c64.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=320, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=64, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c64.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 2621440
#Output tokens: 40960
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 320/320 [02:54<00:00,  1.84it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 64        
Successful requests:                     320       
Benchmark duration (s):                  174.08    
Total input tokens:                      2621440   
Total input text tokens:                 2621440   
Total generated tokens:                  40960     
Total generated tokens (retokenized):    40830     
Request throughput (req/s):              1.84      
Input token throughput (tok/s):          15058.69  
Output token throughput (tok/s):         235.29    
Peak output token throughput (tok/s):    408.00    
Peak concurrent requests:                80        
Total token throughput (tok/s):          15293.98  
Concurrency:                             59.50     
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   32369.21  
Median E2E Latency (ms):                 31188.08  
P90 E2E Latency (ms):                    39007.15  
P95 E2E Latency (ms):                    41580.75  
P99 E2E Latency (ms):                    49018.63  
---------------Time to First Token----------------
Mean TTFT (ms):                          22837.02  
Median TTFT (ms):                        21647.12  
P90 TTFT (ms):                           29317.61  
P95 TTFT (ms):                           32145.84  
P99 TTFT (ms):                           39602.21  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          75.06     
Median TPOT (ms):                        74.54     
P90 TPOT (ms):                           76.98     
P95 TPOT (ms):                           77.76     
P99 TPOT (ms):                           78.51     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           75.12     
Median ITL (ms):                         73.11     
P90 ITL (ms):                            77.89     
P95 ITL (ms):                            83.30     
P99 ITL (ms):                            86.75     
Max ITL (ms):                            373.58    
==================================================
[rails:rdma0] isl8192_osl128_c256 -> /wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c256.json
[aiter] import [module_aiter_core] under /sgl-workspace/aiter/aiter/jit/module_aiter_core.so
[aiter] merge tuned file under model_configs/ and configs/ /sgl-workspace/aiter/aiter/configs/bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv3_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/dsv4_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm47_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/glm5_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/gptoss_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimi_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/kimik2_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama405B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/llama70B_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/minimax_m3_eagle_bf16_tuned_gemm.csv:/sgl-workspace/aiter/aiter/configs/model_configs/qwen32B_bf16_tuned_gemm.csv
/sgl-workspace/sglang/python/sglang/bench_serving.py:13: FutureWarning: `sglang.bench_serving` is deprecated and will be removed in a future release; use `sglang.benchmark.serving` instead (e.g. `python -m sglang.benchmark.serving`).
  warnings.warn(
benchmark_args=Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=1280, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c256.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://127.0.0.1:8000/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang-oai', base_url=None, host='127.0.0.1', port=8000, ready_check_timeout_sec=60, dataset_name='random', dataset_path='', dataset_offset=0, agentic_max_turns=None, speed_bench_category=None, speed_bench_output_len=512, model='/wekafs/models/GLM-5.2-FP8', served_model_name=None, tokenizer='/wekafs/models/GLM-5.2-FP8', num_prompts=1280, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=8192, random_output_len=128, random_range_ratio=1.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=256, output_file='/wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0/isl8192_osl128_c256.json', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
#Input tokens: 10485760
#Output tokens: 163840
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 1280/1280 [10:11<00:00,  2.09it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai
Traffic request rate:                    inf       
Max request concurrency:                 256       
Successful requests:                     1280      
Benchmark duration (s):                  611.04    
Total input tokens:                      10485760  
Total input text tokens:                 10485760  
Total generated tokens:                  163840    
Total generated tokens (retokenized):    162800    
Request throughput (req/s):              2.09      
Input token throughput (tok/s):          17160.65  
Output token throughput (tok/s):         268.14    
Peak output token throughput (tok/s):    957.00    
Peak concurrent requests:                326       
Total token throughput (tok/s):          17428.79  
Concurrency:                             230.85    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   110203.42 
Median E2E Latency (ms):                 125416.07 
P90 E2E Latency (ms):                    126109.75 
P95 E2E Latency (ms):                    132996.14 
P99 E2E Latency (ms):                    133532.66 
---------------Time to First Token----------------
Mean TTFT (ms):                          100430.29 
Median TTFT (ms):                        115815.40 
P90 TTFT (ms):                           116324.48 
P95 TTFT (ms):                           123400.98 
P99 TTFT (ms):                           124014.52 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          76.95     
Median TPOT (ms):                        74.84     
P90 TPOT (ms):                           79.64     
P95 TPOT (ms):                           92.58     
P99 TPOT (ms):                           93.23     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           77.04     
Median ITL (ms):                         74.05     
P90 ITL (ms):                            85.25     
P95 ITL (ms):                            91.04     
P99 ITL (ms):                            119.61    
Max ITL (ms):                            1826.78   
==================================================
[rails:rdma0] scanning legs for RDMA transfer failures
[rails:rdma0] prefill errors: 0, decode errors: 0
[rails:rdma0] results in /wekafs/llying/code/Infera/examples/sglang_glm5.2/bench_rail_rdma0